{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "UObjectCategory",
			"Children": [
				{
					"Source": {
						"Text": "ActorX"
					},
					"Translation": {
						"Text": "ActorX"
					},
					"Key": "ActorX"
				},
				{
					"Source": {
						"Text": "Import Options"
					},
					"Translation": {
						"Text": "导入选项"
					},
					"Key": "Import Options"
				},
				{
					"Source": {
						"Text": "Orientation"
					},
					"Translation": {
						"Text": "朝向"
					},
					"Key": "Orientation"
				},
				{
					"Source": {
						"Text": "Target"
					},
					"Translation": {
						"Text": "目标"
					},
					"Key": "Target"
				}
			]
		},
		{
			"Namespace": "UObjectDisplayNames",
			"Children": [
				{
					"Source": {
						"Text": "+X"
					},
					"Translation": {
						"Text": "+X"
					},
					"Key": "EActorXForwardAxis.PositiveX"
				},
				{
					"Source": {
						"Text": "+Y"
					},
					"Translation": {
						"Text": "+Y"
					},
					"Key": "EActorXForwardAxis.PositiveY"
				},
				{
					"Source": {
						"Text": "-X"
					},
					"Translation": {
						"Text": "-X"
					},
					"Key": "EActorXForwardAxis.NegativeX"
				},
				{
					"Source": {
						"Text": "-Y"
					},
					"Translation": {
						"Text": "-Y"
					},
					"Key": "EActorXForwardAxis.NegativeY"
				},
				{
					"Source": {
						"Text": "Actor XImport Settings"
					},
					"Translation": {
						"Text": "ActorX 导入设置"
					},
					"Key": "ActorXImportSettings"
				},
				{
					"Source": {
						"Text": "Actor XMesh Import Data"
					},
					"Translation": {
						"Text": "ActorX 模型导入数据"
					},
					"Key": "ActorXMeshImportData"
				},
				{
					"Source": {
						"Text": "Actor XOrientation"
					},
					"Translation": {
						"Text": "ActorX 朝向"
					},
					"Key": "ActorXOrientation"
				},
				{
					"Source": {
						"Text": "Auto Detect (Recommended)"
					},
					"Translation": {
						"Text": "自动识别（推荐）"
					},
					"Key": "EPsaSource.Auto"
				},
				{
					"Source": {
						"Text": "Destination"
					},
					"Translation": {
						"Text": "保存路径"
					},
					"Key": "PsaImportSettings:Destination"
				},
				{
					"Source": {
						"Text": "EActor XForward Axis MAX"
					},
					"Translation": {
						"Text": "ActorX 朝向轴上限"
					},
					"Key": "EActorXForwardAxis.EActorXForwardAxis_MAX"
				},
				{
					"Source": {
						"Text": "EPsa Source MAX"
					},
					"Translation": {
						"Text": "PSA 来源上限"
					},
					"Key": "EPsaSource.EPsaSource_MAX"
				},
				{
					"Source": {
						"Text": "FModel / CUE4Parse"
					},
					"Translation": {
						"Text": "FModel / CUE4Parse"
					},
					"Key": "EPsaSource.FModel"
				},
				{
					"Source": {
						"Text": "Import Orientation"
					},
					"Translation": {
						"Text": "导入朝向"
					},
					"Key": "ActorXMeshImportData:Orientation"
				},
				{
					"Source": {
						"Text": "Orientation"
					},
					"Translation": {
						"Text": "朝向"
					},
					"Key": "ActorXImportSettings:Orientation"
				},
				{
					"Source": {
						"Text": "PSA Source"
					},
					"Translation": {
						"Text": "PSA 导出来源"
					},
					"Key": "PsaImportSettings:Source"
				},
				{
					"Source": {
						"Text": "Psa Import Settings"
					},
					"Translation": {
						"Text": "PSA 导入设置"
					},
					"Key": "PsaImportSettings"
				},
				{
					"Source": {
						"Text": "Repair Invalid Keys"
					},
					"Translation": {
						"Text": "修复无效关键帧"
					},
					"Key": "PsaImportSettings:bRepairInvalidKeys"
				},
				{
					"Source": {
						"Text": "Replace Existing Animations"
					},
					"Translation": {
						"Text": "覆盖同名动画"
					},
					"Key": "PsaImportSettings:bReplaceExisting"
				},
				{
					"Source": {
						"Text": "Source Forward"
					},
					"Translation": {
						"Text": "源模型正面"
					},
					"Key": "ActorXOrientation:SourceForward"
				},
				{
					"Source": {
						"Text": "Target Forward"
					},
					"Translation": {
						"Text": "目标朝向"
					},
					"Key": "ActorXOrientation:TargetForward"
				},
				{
					"Source": {
						"Text": "Target Skeletal Mesh"
					},
					"Translation": {
						"Text": "目标骨骼网格"
					},
					"Key": "PsaImportSettings:TargetMesh"
				},
				{
					"Source": {
						"Text": "Translation Scale"
					},
					"Translation": {
						"Text": "位置缩放"
					},
					"Key": "PsaImportSettings:TranslationScale"
				},
				{
					"Source": {
						"Text": "UEViewer / Legacy ActorX"
					},
					"Translation": {
						"Text": "UEViewer / Legacy ActorX"
					},
					"Key": "EPsaSource.ActorX"
				},
				{
					"Source": {
						"Text": "Use Mesh Reference Scale"
					},
					"Translation": {
						"Text": "使用模型参考缩放"
					},
					"Key": "PsaImportSettings:bUseReferenceScale"
				}
			]
		},
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source": {
						"Text": "Default: 1. Adjust only if the FBX mesh uses different units."
					},
					"Translation": {
						"Text": "默认 1。仅当 FBX 模型采用不同单位时调整。"
					},
					"Key": "PsaImportSettings:TranslationScale"
				},
				{
					"Source": {
						"Text": "Detect UEViewer metadata per file, otherwise use FModel. You can also choose the source manually. When UEViewer provides no real hierarchy, match bones by name and use the target mesh hierarchy."
					},
					"Translation": {
						"Text": "默认按每个文件识别 UEViewer 特征，否则沿用 FModel；也可手动指定来源。UEViewer 未提供真实层级时，按骨骼名匹配并沿用目标网格层级。"
					},
					"Key": "PsaImportSettings:Source"
				},
				{
					"Source": {
						"Text": "Forward direction after importing into UE. Rotate around UE +Z, applying the same transform to the mesh and bones."
					},
					"Translation": {
						"Text": "模型导入 UE 后的正面方向。绕 UE 的 +Z 轴旋转，网格和骨骼使用同一变换。"
					},
					"Key": "ActorXOrientation:TargetForward"
				},
				{
					"Source": {
						"Text": "Off by default. Ignore PSA animation scale and use each target mesh bone's reference scale, keeping position and rotation. Useful for unusually stretched animations; intentional scale effects are also ignored."
					},
					"Translation": {
						"Text": "默认关闭。开启后忽略 PSA 的动画缩放，改用目标网格各骨骼的参考缩放；位置和旋转不变。适用于异常拉伸的动画，也会忽略原本有意制作的缩放效果。"
					},
					"Key": "PsaImportSettings:bUseReferenceScale"
				},
				{
					"Source": {
						"Text": "Off by default. Repair keys per animation and bone: interpolate interior gaps; copy the nearest valid frame at either end; fail if the entire track is invalid. Position, rotation, and scale are repaired together. Repairs estimate poses and do not recover the original motion."
					},
					"Translation": {
						"Text": "默认关闭。按同一动画、同一骨骼补帧：中间缺帧使用前后有效帧插值，首尾缺帧全部复制最近有效帧；整条轨道均无效则失败。无效姿态的位置、旋转和缩放一起修复。补帧是估算，不会恢复丢失的原始动作。"
					},
					"Key": "PsaImportSettings:bRepairInvalidKeys"
				},
				{
					"Source": {
						"Text": "Off by default: generate a unique name. When enabled, overwrite only animation sequences using the same Skeleton."
					},
					"Translation": {
						"Text": "默认不覆盖，自动生成不同名称。勾选后仅覆盖使用相同 Skeleton 的动画序列。"
					},
					"Key": "PsaImportSettings:bReplaceExisting"
				},
				{
					"Source": {
						"Text": "Select a Skeletal Mesh imported from PSK or FBX. Animations will use its Skeleton."
					},
					"Translation": {
						"Text": "选择由 PSK 或 FBX 导入的 Skeletal Mesh。动画使用它的 Skeleton。"
					},
					"Key": "PsaImportSettings:TargetMesh"
				},
				{
					"Source": {
						"Text": "Serialized with the mesh so animations imported in a later editor session use the same basis."
					},
					"Translation": {
						"Text": "随模型保存导入朝向，使之后导入的动画使用相同坐标基准。"
					},
					"Key": "ActorXMeshImportData"
				},
				{
					"Source": {
						"Text": "Source forward direction after restoring UE coordinates. The girl023 sample uses +X. Use the same settings for every body part of a character."
					},
					"Translation": {
						"Text": "源模型在还原为 UE 坐标后的正面方向。当前 girl023 样本为 +X；同一角色所有身体部件必须使用相同设置。"
					},
					"Key": "ActorXOrientation:SourceForward"
				},
				{
					"Source": {
						"Text": "UE content path, such as /Game/Characters/Animations."
					},
					"Translation": {
						"Text": "UE 内容路径，例如 /Game/Characters/Animations。"
					},
					"Key": "PsaImportSettings:Destination"
				}
			]
		},
		{
			"Namespace": "UnrealPSKPSA",
			"Children": [
				{
					"Source": {
						"Text": "(auto-detected)"
					},
					"Translation": {
						"Text": "（自动识别）"
					},
					"Key": "AutomaticSource"
				},
				{
					"Source": {
						"Text": "(manual)"
					},
					"Translation": {
						"Text": "（手动选择）"
					},
					"Key": "ManualSource"
				},
				{
					"Source": {
						"Text": "A PSK/PSKX skeletal mesh requires both bones and skin weights. Incomplete data cannot be imported as a skeletal mesh."
					},
					"Translation": {
						"Text": "PSK/PSKX 骨骼网格必须同时包含骨骼和蒙皮权重；数据不完整，无法导入为骨骼网格。"
					},
					"Key": "MissingSkinData"
				},
				{
					"Source": {
						"Text": "Add from Folder…"
					},
					"Translation": {
						"Text": "从文件夹添加…"
					},
					"Key": "ChooseFolder"
				},
				{
					"Source": {
						"Text": "Animation key {0} contains an invalid position or rotation (such as a zero quaternion). Enable \"Repair Invalid Keys\" to attempt repair, or export it again."
					},
					"Translation": {
						"Text": "第 {0} 个动画关键帧包含无效的位置或旋转（如零四元数）。可勾选“修复无效关键帧”尝试补帧，或重新导出。"
					},
					"Key": "PsaInvalidPose"
				},
				{
					"Source": {
						"Text": "Animation key {0} has an invalid time. Export it again."
					},
					"Translation": {
						"Text": "第 {0} 个动画关键帧时间无效，请重新导出。"
					},
					"Key": "PsaInvalidKeyTime"
				},
				{
					"Source": {
						"Text": "Animation orientation: inherit the target mesh ({0}). To change it, import the mesh with the new orientation, then import the animation again."
					},
					"Translation": {
						"Text": "动画朝向：沿用目标网格（{0}）。如需改变，请先用新朝向导入模型，再导入动画。"
					},
					"Key": "OrientationInherited"
				},
				{
					"Source": {
						"Text": "Animation orientation: select a target mesh to inherit its orientation."
					},
					"Translation": {
						"Text": "动画朝向：选择目标网格后自动读取，网格与动画保持一致。"
					},
					"Key": "OrientationNoMesh"
				},
				{
					"Source": {
						"Text": "Animation orientation: this mesh has no ActorX orientation metadata; keep its original coordinates. To change an older mesh to +Y, import the PSK again and choose the target direction."
					},
					"Translation": {
						"Text": "动画朝向：目标网格未记录 ActorX 朝向，保持原有坐标。旧模型如需改为 +Y，请重新导入 PSK 并选择目标朝向。"
					},
					"Key": "OrientationNoMetadata"
				},
				{
					"Source": {
						"Text": "Animation {0}, bone {1} has no valid frames to use for repair."
					},
					"Translation": {
						"Text": "动画 {0} 的骨骼 {1} 全部帧无效，没有可用于补帧的有效帧。"
					},
					"Key": "NoRepairAnchor"
				},
				{
					"Source": {
						"Text": "Cancel"
					},
					"Translation": {
						"Text": "取消"
					},
					"Key": "Cancel"
				},
				{
					"Source": {
						"Text": "Cannot import '{0}': {1}"
					},
					"Translation": {
						"Text": "无法导入“{0}”：{1}"
					},
					"Key": "PskImportError"
				},
				{
					"Source": {
						"Text": "Cannot read file."
					},
					"Translation": {
						"Text": "无法读取文件。"
					},
					"Key": "PskReadFailed"
				},
				{
					"Source": {
						"Text": "Cannot read the PSA file."
					},
					"Translation": {
						"Text": "无法读取 PSA 文件。"
					},
					"Key": "PsaReadFailed"
				},
				{
					"Source": {
						"Text": "Choose PSA Animations"
					},
					"Translation": {
						"Text": "选择 PSA 动画"
					},
					"Key": "ChooseFilesTitle"
				},
				{
					"Source": {
						"Text": "Choose PSA Files…"
					},
					"Translation": {
						"Text": "选择 PSA 文件…"
					},
					"Key": "ChooseFiles"
				},
				{
					"Source": {
						"Text": "Choose a PSA Folder (Current Directory Only)"
					},
					"Translation": {
						"Text": "选择包含 PSA 的文件夹（仅当前目录）"
					},
					"Key": "ChooseFolderTitle"
				},
				{
					"Source": {
						"Text": "Choose a skeletal mesh and import one or more PSA animation files."
					},
					"Translation": {
						"Text": "选择骨骼网格并导入一个或多个 PSA 动画文件。"
					},
					"Key": "ImportMenuTooltip"
				},
				{
					"Source": {
						"Text": "Chunk {0} has record size {1}; expected {2}."
					},
					"Translation": {
						"Text": "数据块 {0} 的记录大小为 {1}，应为 {2}。"
					},
					"Key": "PskRecordSize"
				},
				{
					"Source": {
						"Text": "Clear"
					},
					"Translation": {
						"Text": "清空"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "Destination must be a valid content path, such as /Game/Animations."
					},
					"Translation": {
						"Text": "保存路径必须是有效的内容路径，例如 /Game/Animations。"
					},
					"Key": "InvalidDestination"
				},
				{
					"Source": {
						"Text": "Error"
					},
					"Translation": {
						"Text": "错误"
					},
					"Key": "LogError"
				},
				{
					"Source": {
						"Text": "Extra UV count does not match wedges."
					},
					"Translation": {
						"Text": "额外 UV 数量与面角数量不一致。"
					},
					"Key": "PskExtraUVCount"
				},
				{
					"Source": {
						"Text": "Failed to create skeletal mesh description for {0}"
					},
					"Translation": {
						"Text": "无法为 {0} 创建骨骼网格描述"
					},
					"Key": "PskMeshDescriptionFailed"
				},
				{
					"Source": {
						"Text": "Ignored {0} source bones absent from the target mesh."
					},
					"Translation": {
						"Text": "忽略 {0} 根目标网格中不存在的源骨骼。"
					},
					"Key": "UnmatchedSourceBones"
				},
				{
					"Source": {
						"Text": "Import"
					},
					"Translation": {
						"Text": "导入"
					},
					"Key": "Import"
				},
				{
					"Source": {
						"Text": "Import Animations"
					},
					"Translation": {
						"Text": "导入动画"
					},
					"Key": "ImportAnimations"
				},
				{
					"Source": {
						"Text": "Import PSA Animations"
					},
					"Translation": {
						"Text": "导入 PSA 动画"
					},
					"Key": "PanelTitle"
				},
				{
					"Source": {
						"Text": "Import PSA Animation…"
					},
					"Translation": {
						"Text": "导入 PSA 动画…"
					},
					"Key": "ImportMenu"
				},
				{
					"Source": {
						"Text": "Import PSA animation"
					},
					"Translation": {
						"Text": "导入 PSA 动画"
					},
					"Key": "ImportPSA"
				},
				{
					"Source": {
						"Text": "Import PSA animations using this skeletal mesh's Skeleton."
					},
					"Translation": {
						"Text": "使用此骨骼网格的 Skeleton 导入 PSA 动画。"
					},
					"Key": "MeshMenuTooltip"
				},
				{
					"Source": {
						"Text": "Import canceled; {0} files were not processed."
					},
					"Translation": {
						"Text": "已取消导入，剩余 {0} 个文件未处理。"
					},
					"Key": "ImportCanceled"
				},
				{
					"Source": {
						"Text": "Import complete."
					},
					"Translation": {
						"Text": "导入完成。"
					},
					"Key": "ImportComplete"
				},
				{
					"Source": {
						"Text": "Importing PSA animations"
					},
					"Translation": {
						"Text": "正在导入 PSA 动画"
					},
					"Key": "ImportProgress"
				},
				{
					"Source": {
						"Text": "Incompatible bone hierarchy. Use the matching source mesh or retarget the animation first:\n"
					},
					"Translation": {
						"Text": "骨骼层级不兼容，需要对应的源网格或先进行动画重定向：\n"
					},
					"Key": "HierarchyMismatch"
				},
				{
					"Source": {
						"Text": "Invalid PSA file: missing ANIMHEAD."
					},
					"Translation": {
						"Text": "文件不是有效的 PSA（缺少 ANIMHEAD）。"
					},
					"Key": "PsaMissingSignature"
				},
				{
					"Source": {
						"Text": "Invalid bone name, hierarchy or transform."
					},
					"Translation": {
						"Text": "骨骼名称、层级或变换无效。"
					},
					"Key": "PskInvalidBone"
				},
				{
					"Source": {
						"Text": "Invalid face material index."
					},
					"Translation": {
						"Text": "面的材质索引无效。"
					},
					"Key": "PskInvalidMaterial"
				},
				{
					"Source": {
						"Text": "Invalid face wedge index."
					},
					"Translation": {
						"Text": "面的面角索引无效。"
					},
					"Key": "PskInvalidFaceWedge"
				},
				{
					"Source": {
						"Text": "Invalid keys lie outside the animation ranges; no repair anchors can be determined."
					},
					"Translation": {
						"Text": "无效关键帧位于动画范围之外，无法确定补帧依据。"
					},
					"Key": "RepairOutsideRange"
				},
				{
					"Source": {
						"Text": "Invalid morph delta."
					},
					"Translation": {
						"Text": "形变增量无效。"
					},
					"Key": "PskInvalidMorph"
				},
				{
					"Source": {
						"Text": "Invalid or truncated chunk {0}."
					},
					"Translation": {
						"Text": "数据块 {0} 无效或被截断。"
					},
					"Key": "PskInvalidChunk"
				},
				{
					"Source": {
						"Text": "Invalid skin weight or bone/point index."
					},
					"Translation": {
						"Text": "蒙皮权重或骨骼/顶点索引无效。"
					},
					"Key": "PskInvalidWeight"
				},
				{
					"Source": {
						"Text": "Invalid wedge point index or UV."
					},
					"Translation": {
						"Text": "面角的顶点索引或 UV 无效。"
					},
					"Key": "PskInvalidWedge"
				},
				{
					"Source": {
						"Text": "Missing ACTRHEAD signature."
					},
					"Translation": {
						"Text": "缺少 ACTRHEAD 标识。"
					},
					"Key": "PskMissingSignature"
				},
				{
					"Source": {
						"Text": "Missing points, wedges, faces or materials."
					},
					"Translation": {
						"Text": "缺少顶点、面角、面或材质。"
					},
					"Key": "PskMissingData"
				},
				{
					"Source": {
						"Text": "Morph data count mismatch."
					},
					"Translation": {
						"Text": "形变数据数量不匹配。"
					},
					"Key": "PskMorphCount"
				},
				{
					"Source": {
						"Text": "Negative morph vertex count."
					},
					"Translation": {
						"Text": "形变顶点数量为负数。"
					},
					"Key": "PskNegativeMorphCount"
				},
				{
					"Source": {
						"Text": "No PSA files selected"
					},
					"Translation": {
						"Text": "尚未选择 PSA 文件"
					},
					"Key": "NoFiles"
				},
				{
					"Source": {
						"Text": "No entries match the current filters ({0} total)."
					},
					"Translation": {
						"Text": "当前筛选条件下没有日志（共 {0} 条）。"
					},
					"Key": "NoVisibleLog"
				},
				{
					"Source": {
						"Text": "No import log yet."
					},
					"Translation": {
						"Text": "尚无导入日志。"
					},
					"Key": "NoLog"
				},
				{
					"Source": {
						"Text": "Non-finite UV."
					},
					"Translation": {
						"Text": "UV 包含非有限数值。"
					},
					"Key": "PskNonFiniteUV"
				},
				{
					"Source": {
						"Text": "Non-finite normal."
					},
					"Translation": {
						"Text": "法线包含非有限数值。"
					},
					"Key": "PskNonFiniteNormal"
				},
				{
					"Source": {
						"Text": "Non-finite vertex position."
					},
					"Translation": {
						"Text": "顶点位置包含非有限数值。"
					},
					"Key": "PskNonFinitePosition"
				},
				{
					"Source": {
						"Text": "Normal or color count does not match points or wedges."
					},
					"Translation": {
						"Text": "法线或颜色数量与顶点或面角数量不一致。"
					},
					"Key": "PskAttributeCount"
				},
				{
					"Source": {
						"Text": "Not enough bones with matching names were found."
					},
					"Translation": {
						"Text": "没有足够的同名骨骼可匹配。"
					},
					"Key": "InsufficientMatches"
				},
				{
					"Source": {
						"Text": "Open the PSA importer to select a skeletal mesh and import animations."
					},
					"Translation": {
						"Text": "打开 PSA 动画导入面板，选择骨骼网格并导入动画。"
					},
					"Key": "ToolbarTooltip"
				},
				{
					"Source": {
						"Text": "Orientation: {0}."
					},
					"Translation": {
						"Text": "朝向：{0}。"
					},
					"Key": "OrientationSummary"
				},
				{
					"Source": {
						"Text": "Overlapping animation ranges produce conflicting repairs. Export and import each animation separately."
					},
					"Translation": {
						"Text": "动画帧区间重叠，补帧结果存在冲突，请分别导出动画后再导入。"
					},
					"Key": "RepairOverlap"
				},
				{
					"Source": {
						"Text": "PSA Animation"
					},
					"Translation": {
						"Text": "PSA 动画"
					},
					"Key": "ToolbarLabel"
				},
				{
					"Source": {
						"Text": "PSA chunk {0} has an invalid size or is truncated."
					},
					"Translation": {
						"Text": "PSA 数据块 {0} 长度无效或文件被截断。"
					},
					"Key": "PsaInvalidChunk"
				},
				{
					"Source": {
						"Text": "PSA does not include UE notifies, curves, or complete additive settings. Animations are imported as sampled poses."
					},
					"Translation": {
						"Text": "PSA 不包含 UE 通知、曲线和完整增量动画设置，动画按采样姿态导入。"
					},
					"Key": "SampledPosesNote"
				},
				{
					"Source": {
						"Text": "PSK / PSKX Import Orientation"
					},
					"Translation": {
						"Text": "PSK / PSKX 导入朝向"
					},
					"Key": "MeshPanelTitle"
				},
				{
					"Source": {
						"Text": "PSKX detected as {0}, but the existing asset type is {1}. Import with a new name or folder."
					},
					"Translation": {
						"Text": "PSKX 检测为 {0}，但同名资产类型为 {1}。请使用新名称或目录导入。"
					},
					"Key": "PskxTypeMismatch"
				},
				{
					"Source": {
						"Text": "Partial-skeleton or compressed PSA data is not supported."
					},
					"Translation": {
						"Text": "暂不支持局部骨骼或压缩的 PSA 数据。"
					},
					"Key": "PsaUnsupportedData"
				},
				{
					"Source": {
						"Text": "Read {0}: {1} points, {2} triangles, {3} bones, {4} UV channels"
					},
					"Translation": {
						"Text": "已读取 {0}：{1} 个顶点，{2} 个三角形，{3} 根骨骼，{4} 个 UV 通道"
					},
					"Key": "PskReadSummary"
				},
				{
					"Source": {
						"Text": "Remaining files canceled."
					},
					"Translation": {
						"Text": "已取消剩余文件。"
					},
					"Key": "RemainingCanceled"
				},
				{
					"Source": {
						"Text": "Repaired {0} bone keys ({1} interpolated, {2} copied at the ends); repaired poses are estimates."
					},
					"Translation": {
						"Text": "已修复 {0} 个骨骼关键帧（中间插值 {1}，首尾复制 {2}）；补帧为估算姿态。"
					},
					"Key": "RepairedKeys"
				},
				{
					"Source": {
						"Text": "Select a Skeletal Mesh that has a Skeleton."
					},
					"Translation": {
						"Text": "请选择具有 Skeleton 的 Skeletal Mesh（骨骼网格体）。"
					},
					"Key": "MissingTargetSkeleton"
				},
				{
					"Source": {
						"Text": "Select a skeletal mesh imported from PSK or FBX, then choose PSA animations."
					},
					"Translation": {
						"Text": "选择已导入 UE 的骨骼网格，再选择 PSA 动画。网格可来自 PSK 或 FBX。"
					},
					"Key": "PanelIntroduction"
				},
				{
					"Source": {
						"Text": "Show Imported Assets"
					},
					"Translation": {
						"Text": "显示导入结果"
					},
					"Key": "ShowResults"
				},
				{
					"Source": {
						"Text": "Show log:"
					},
					"Translation": {
						"Text": "显示日志："
					},
					"Key": "ShowLog"
				},
				{
					"Source": {
						"Text": "Show or hide this log level. Hiding entries does not discard them. The number is the entry count for this import."
					},
					"Translation": {
						"Text": "勾选以显示该级别日志；取消勾选仅隐藏日志。括号内为本次导入的日志条数。"
					},
					"Key": "LogFilterTooltip"
				},
				{
					"Source": {
						"Text": "Source {0} → UE {1}"
					},
					"Translation": {
						"Text": "源 {0} → UE {1}"
					},
					"Key": "OrientationDescription"
				},
				{
					"Source": {
						"Text": "Source: {0} {1}."
					},
					"Translation": {
						"Text": "来源：{0}{1}。"
					},
					"Key": "SourceSummary"
				},
				{
					"Source": {
						"Text": "Success"
					},
					"Translation": {
						"Text": "成功"
					},
					"Key": "LogSuccess"
				},
				{
					"Source": {
						"Text": "The PSA animation bone count, frame range, or frame rate is invalid."
					},
					"Translation": {
						"Text": "PSA 动画骨骼数量、帧范围或帧率无效。"
					},
					"Key": "PsaInvalidSequence"
				},
				{
					"Source": {
						"Text": "The PSA chunk header is truncated."
					},
					"Translation": {
						"Text": "PSA 数据块头被截断。"
					},
					"Key": "PsaTruncatedHeader"
				},
				{
					"Source": {
						"Text": "The PSA contains duplicate chunks."
					},
					"Translation": {
						"Text": "PSA 包含重复的数据块。"
					},
					"Key": "PsaDuplicateChunk"
				},
				{
					"Source": {
						"Text": "The PSA has duplicate or empty bone names, or an invalid hierarchy."
					},
					"Translation": {
						"Text": "PSA 骨骼名称重复、为空或层级无效。"
					},
					"Key": "PsaInvalidHierarchy"
				},
				{
					"Source": {
						"Text": "The PSA is missing bones, animation information, or keys."
					},
					"Translation": {
						"Text": "PSA 缺少骨骼、动画信息或关键帧。"
					},
					"Key": "PsaMissingData"
				},
				{
					"Source": {
						"Text": "The PSA scale key count does not match the animation key count."
					},
					"Translation": {
						"Text": "PSA 缩放帧数量与动画帧数量不一致。"
					},
					"Key": "PsaScaleCountMismatch"
				},
				{
					"Source": {
						"Text": "The animation contains an invalid scale key time. Export it again."
					},
					"Translation": {
						"Text": "动画包含无效的缩放关键帧时间，请重新导出。"
					},
					"Key": "PsaInvalidScaleTime"
				},
				{
					"Source": {
						"Text": "The animation contains invalid scale values. Enable \"Repair Invalid Keys\" to attempt repair, or export it again."
					},
					"Translation": {
						"Text": "动画包含无效的缩放。可勾选“修复无效关键帧”尝试补帧，或重新导出。"
					},
					"Key": "PsaInvalidScale"
				},
				{
					"Source": {
						"Text": "The animation was created but could not be saved. Check the output folder and save manually: {0}"
					},
					"Translation": {
						"Text": "动画已生成，但保存失败，请检查输出目录后手动保存：{0}"
					},
					"Key": "SaveAnimationFailed"
				},
				{
					"Source": {
						"Text": "The existing asset type or Skeleton does not match; not overwritten: {0}"
					},
					"Translation": {
						"Text": "同名资产的类型或 Skeleton 不匹配，未覆盖：{0}"
					},
					"Key": "ExistingAssetMismatch"
				},
				{
					"Source": {
						"Text": "The target mesh and PSA root bone names differ. Select the matching mesh."
					},
					"Translation": {
						"Text": "目标网格与 PSA 的根骨骼名称不同，请选择对应的网格。"
					},
					"Key": "RootMismatch"
				},
				{
					"Source": {
						"Text": "This PSA uses a UEViewer placeholder hierarchy. Bones are matched by name using the target mesh hierarchy; select the corresponding character mesh."
					},
					"Translation": {
						"Text": "此 PSA 使用 UEViewer 占位层级，按骨骼名称匹配并沿用目标网格层级；请确保选择对应人物的模型。"
					},
					"Key": "UEViewerHierarchyWarning"
				},
				{
					"Source": {
						"Text": "Translation scale must be a finite number greater than zero."
					},
					"Translation": {
						"Text": "位置缩放必须是大于零的有限数值。"
					},
					"Key": "InvalidTranslationScale"
				},
				{
					"Source": {
						"Text": "Truncated chunk header."
					},
					"Translation": {
						"Text": "数据块头被截断。"
					},
					"Key": "PskTruncatedHeader"
				},
				{
					"Source": {
						"Text": "UE could not write animation tracks: {0}"
					},
					"Translation": {
						"Text": "UE 写入动画轨道失败：{0}"
					},
					"Key": "WriteTracksFailed"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "未知"
					},
					"Key": "UnknownAxis"
				},
				{
					"Source": {
						"Text": "Unsupported extra UV channel (maximum total is 8)."
					},
					"Translation": {
						"Text": "不支持此额外 UV 通道（最多共 8 个通道）。"
					},
					"Key": "PskExtraUVLimit"
				},
				{
					"Source": {
						"Text": "Use the same source and target forward directions for all body, hair, and clothing parts. Meshes, normals, morphs, and bones rotate together; PSA animations inherit the target mesh settings.\nAfter changing an existing mesh orientation, import its PSA animations again."
					},
					"Translation": {
						"Text": "身体、头发、服装等部件请使用相同的源正面和目标朝向。网格、法线、形变与骨骼将整体旋转；PSA 动画自动沿用目标网格的设置。\n修改已有模型的朝向后，需重新导入对应 PSA 动画。"
					},
					"Key": "MeshOrientationNote"
				},
				{
					"Source": {
						"Text": "Using mesh reference scale: PSA animation scale effects are ignored; position and rotation are imported normally."
					},
					"Translation": {
						"Text": "已使用模型参考缩放：忽略 PSA 的动画缩放（包括原有缩放效果），位置和旋转保持正常导入。"
					},
					"Key": "UseReferenceScaleWarning"
				},
				{
					"Source": {
						"Text": "Valid key values exceed the repair calculation range. Export the animation again."
					},
					"Translation": {
						"Text": "有效帧数值超出补帧计算范围，请重新导出动画。"
					},
					"Key": "RepairOverflow"
				},
				{
					"Source": {
						"Text": "Warning"
					},
					"Translation": {
						"Text": "警告"
					},
					"Key": "LogWarning"
				},
				{
					"Source": {
						"Text": "{0} (PSA parent: {1}; target parent: {2})"
					},
					"Translation": {
						"Text": "{0}（PSA 父骨骼：{1}；目标：{2}）"
					},
					"Key": "ParentMismatch"
				},
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0}（{1}）"
					},
					"Key": "LogFilterCount"
				},
				{
					"Source": {
						"Text": "{0} PSA files selected"
					},
					"Translation": {
						"Text": "已选择 {0} 个 PSA 文件"
					},
					"Key": "SelectedFiles"
				},
				{
					"Source": {
						"Text": "{0} record size should be {1}; found {2}."
					},
					"Translation": {
						"Text": "{0} 记录大小应为 {1}，实际为 {2}。"
					},
					"Key": "PsaRecordSize"
				},
				{
					"Source": {
						"Text": "{0} target bones have no animation tracks and keep their reference pose."
					},
					"Translation": {
						"Text": "{0} 根目标骨骼缺失动画轨道，保持参考姿态。"
					},
					"Key": "MissingTargetTracks"
				},
				{
					"Source": {
						"Text": "{0} {1} files succeeded, {2} failed; {3} animations created.\nDestination: {4}"
					},
					"Translation": {
						"Text": "{0}成功 {1} 个文件，失败 {2} 个文件，生成 {3} 个动画。\n保存路径：{4}"
					},
					"Key": "BatchSummary"
				},
				{
					"Source": {
						"Text": "{0}: import was incomplete; {1} animations were created. Check the results and save status."
					},
					"Translation": {
						"Text": "{0}：本文件未完整导入，已生成 {1} 个动画，请检查导入结果及保存状态。"
					},
					"Key": "PartialImport"
				},
				{
					"Source": {
						"Text": "{0}: {1} animations; matched {2}/{3} target bones."
					},
					"Translation": {
						"Text": "{0}：{1} 个动画；匹配 {2}/{3} 根目标骨骼。"
					},
					"Key": "FileSummary"
				}
			]
		}
	]
}